app/controllers/arduino_controller.rb

  def index

    @servox.position = Servoposx.last.xloc
    @servoy.position = Servoposy.last.yloc
---
SELECT "servoposxes".* FROM "servoposxes" ORDER BY "servoposxes"."id" DESC LIMIT 1
SELECT "servoposies".* FROM "servoposies" ORDER BY "servoposies"."id" DESC LIMIT 1

  def up

    @pos = Servoposy.all
    @inc_by_five = @pos.last.yloc.to_i
    @new_pos = @inc_by_five + 10
    Servoposy.create(yloc: @new_pos.to_i)
---
SELECT "servoposies".* FROM "servoposies" ORDER BY "servoposies"."id" DESC LIMIT 1
INSERT INTO "servoposies" ("created_at", "updated_at", "yloc") VALUES (?, ?, ?)  [["created_at", Sun, 20 Apr 2014 02:02:17 UTC +00:00], ["updated_at", Sun, 20 Apr 2014 02:02:17 UTC +00:00], ["yloc", 100]]

  def down

    @pos = Servoposy.all
    @inc_by_five = @pos.last.yloc.to_i
    @new_pos = @inc_by_five - 10
    Servoposy.create(yloc: @new_pos.to_i)
---
SELECT "servoposies".* FROM "servoposies" ORDER BY "servoposies"."id" DESC LIMIT 1
INSERT INTO "servoposies" ("created_at", "updated_at", "yloc") VALUES (?, ?, ?)  [["created_at", Sun, 20 Apr 2014 02:03:25 UTC +00:00], ["updated_at", Sun, 20 Apr 2014 02:03:25 UTC +00:00], ["yloc", 540]]

  def left

    @pos = Servoposx.all
    @dec_by_five = @pos.last.xloc.to_i
    @new_pos = @dec_by_five - 10
    Servoposx.create(xloc: @new_pos.to_i)
---
SELECT "servoposxes".* FROM "servoposxes" ORDER BY "servoposxes"."id" DESC LIMIT 1
INSERT INTO "servopos" ("created_at", "updated_at", "xloc") VALUES (?, ?, ?)  [["created_at", Sat, 19 Apr 2014 05:35:44 UTC +00:00], ["updated_at", Sat, 19 Apr 2014 05:35:44 UTC +00:00], ["xloc", 3045]]
INSERT INTO "servoposxes" ("created_at", "updated_at", "xloc") VALUES (?, ?, ?)  [["created_at", Sun, 20 Apr 2014 02:03:30 UTC +00:00], ["updated_at", Sun, 20 Apr 2014 02:03:30 UTC +00:00], ["xloc", 370]]

  def right

    @pos = Servoposx.all
    @inc_by_five = @pos.last.xloc.to_i
    @new_pos = @inc_by_five + 10
    Servoposx.create(xloc: @new_pos.to_i)
---
SELECT "servoposxes".* FROM "servoposxes" ORDER BY "servoposxes"."id" DESC LIMIT 1
INSERT INTO "servopos" ("created_at", "updated_at", "xloc") VALUES (?, ?, ?)  [["created_at", Sat, 19 Apr 2014 05:06:15 UTC +00:00], ["updated_at", Sat, 19 Apr 2014 05:06:15 UTC +00:00], ["xloc", 35]]
INSERT INTO "servoposxes" ("created_at", "updated_at", "xloc") VALUES (?, ?, ?)  [["created_at", Sun, 20 Apr 2014 01:59:29 UTC +00:00], ["updated_at", Sun, 20 Apr 2014 01:59:29 UTC +00:00], ["xloc", 95]]